README.org

Learning about Scraping with python by David Arroyo Menéndez

You can check external documentation in
+ https://requests.readthedocs.io/en/latest/
+ https://mechanicalsoup.readthedocs.io/en/stable/
+ https://newspaper.readthedocs.io/en/latest/

* Installing from pypi

First, to create a python virtual environment
#+BEGIN_SRC
$ mkdir ~/venv-damescraping
$ python3.14 -m venv ~/venv-damescraping
$ cd venv-damescraping
$ source bin/activate
#+END_SRC

Second, to download the python package
#+BEGIN_SRC
$ python3.14 -m pip install damescraping
#+END_SRC

Last, to go the directory and to check files and directories
#+BEGIN_SRC
$ cd lib/python3.14/site-packages/damescraping
$ ls
#+END_SRC

* Installing from git
#+BEGIN_SRC
$ git clone https://github.com/davidam/damescraping
$ pip3 install markdown mechanicalsoup newspaper3k lxml requests
$ cd damescraping
#+END_SRC

* Execute test
#+BEGIN_SRC
$ cd damescraping
$ ./runtest.sh
#+END_SRC

* Making and uploading a pypi package

To install create tar.gz in dist directory:

#+BEGIN_SRC
$ cd damescraping
$ python3 -m build
$ twine upload dist/damescraping-0.1.tar.gz
#+END_SRC
